name = input("请输入你的名字。<")
if name == "赵超":
    print ("""
你被柯宇鑫被关进了一个有两扇门的暗室。 
你是通过1号门还是2号门?
""")
    door = input ("请输入1或者2。 >")

    if door == "1":
        print ("""
这里有只大熊在吃奶酪蛋糕。
你准备怎么做？
1.拿着蛋糕。
2.对着熊尖叫。
""")

        bear = input ("请输入1或者2。 >")
        if bear == "1":
            print ("熊把你的头吃了。 Good job!")
            input("哈哈哈")
        elif bear == "2":
            print ("熊把你的手吃了。 Good job!")
            input("哈哈哈")
        else:
            print ("嗯嗯，小机灵鬼，知道那两个选项是陷阱了，恭喜你选对了，熊走了，你活下来了。")
            input("哈哈哈")


    elif door == "2":
        print ("""
你面前出现了一个无尽的深渊，深渊的下面好像有一只怪物在看着你。
请做出你的选择
1.拿出衣服口袋里的蓝莓派，吃掉。
2.先吸支烟冷静冷静。
3.摸出左轮手枪，一句话干。
""")


        insanity = input ("请输入1或者2或者3。 >")
        if insanity == "1" or insanity == "2":
            print ("怪物看你这么淡定，心想不对，就跑了。你顺着旁边的路下去，离开了深渊。")
            input("哈哈哈")
        else:
            print ("怪物会怕你？你最后变成了一堆怪物的排泄物~~~")
            input("哈哈哈")
    else:
        print ("你刚跨出去，就掉进了深渊，被怪物吃了，叫你不走门。")
        input("哈哈哈")


elif name == "柯宇鑫":
    print ("""
你被赵超被关进了一个有两扇门的暗室。 
你是通过1号门还是2号门?
""")

    door = input ("请输入1或者2。 >")
    if door == "1":
        print ("""
这里有只大熊在吃奶酪蛋糕。
你准备怎么做？
1.拿着蛋糕。
2.对着熊尖叫。
""")

        bear = input ("请输入1或者2。 >")
        if bear == "1":
            print ("熊把你的头吃了。 Good job!")
            input("哈哈哈")
        elif bear == "2":
            print ("熊把你的手吃了。 Good job!")
            input("哈哈哈")
        else:
            print ("嗯嗯，小机灵鬼，知道那两个选项是陷阱了，恭喜你选对了，熊走了，你活下来了。")
            input("哈哈哈")



    elif door == "2":
        print ("""
你面前出现了一个无尽的深渊，深渊的下面好像有一只怪物在看着你。
请做出你的选择
1.拿出衣服口袋里的蓝莓派，吃掉。
2.先吸支烟冷静冷静。
3.摸出左轮手枪，一句话干。
""")


        insanity = input ("请输入1或者2或者3。 >")
        if insanity == "1" or insanity == "2":
            print ("怪物看你这么淡定，心想不对，就跑了。你顺着旁边的路下去，离开了深渊。")
            input("哈哈哈")
        else:
            print ("怪物会怕你？你最后变成了一堆怪物的排泄物~~~")
            input("哈哈哈")

    else:
        print ("你刚跨出去，就掉进了深渊，被怪物吃了，叫你不走门。")
        input("哈哈哈")

elif name == "周必铙":
    print ("小样，想关我，现在就把你喂熊去！")
    input("哈哈哈")




